app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    if @room.save
---
INSERT INTO "rooms" ("title", "description", "created_at", "updated_at", "image_url") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["created_at", 2018-05-31 00:11:28 UTC], ["updated_at", 2018-05-31 00:11:28 UTC], ["image_url", ""]]

  def edit
    @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @room = Room.find(params[:id])
    @room.destroy
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 3]]